Part A: Data preparation (Data Cleaning and Data Preprocessing)
Step 1: Import original / source dataset.

In [3]:
import pandas as pd
df = pd.read_csv("../Machine_Learning\Dataset\wet-bulb-temperature-hourly.csv",header='infer')
df

          wbt_date  wbt_time  wet_bulb_temperature
0       1982-01-01         1                  24.7
1       1982-01-01         2                  24.5
2       1982-01-01         3                  24.3
3       1982-01-01         4                  24.2
4       1982-01-01         5                  24.2
...            ...       ...                   ...
351379  2022-01-31        20                  24.5
351380  2022-01-31        21                  24.5
351381  2022-01-31        22                  24.4
351382  2022-01-31        23                  24.5
351383  2022-01-31        24                  24.7

[351384 rows x 3 columns]

Step 2: Remove unessary data set. Only requires last 5 years / 60 Months dataset.

As the original dataset is using hourly dataset, we will need to calculate how many hourly dataset is required of X months using the formula: 

number of dataset required = months * weeks * days * hours

In [11]:
months = 60
no_of_dataset_required = months * 4 * 7 *24
print('Number of dataset required = %d' % (no_of_dataset_required))
df.tail(no_of_dataset_required)

Number of dataset required = 40320

          wbt_date  wbt_time  wet_bulb_temperature
311064  2017-06-27         1                  25.6
311065  2017-06-27         2                  25.6
311066  2017-06-27         3                  25.9
311067  2017-06-27         4                  26.0
311068  2017-06-27         5                  22.7
...            ...       ...                   ...
351379  2022-01-31        20                  24.5
351380  2022-01-31        21                  24.5
351381  2022-01-31        22                  24.4
351382  2022-01-31        23                  24.5
351383  2022-01-31        24                  24.7

[40320 rows x 3 columns]

Step 3: Check for any duplicate data in original dataset

In [12]:
print('Number of rows before discarding duplicates = %d' % (df.shape[0]))
df_remove_dup = df.drop_duplicates()
print('Number of rows after discarding duplicates = %d' % (df_remove_dup.shape[0]))

Number of rows before discarding duplicates = 351384
Number of rows after discarding duplicates = 351384

Step 4: 
i)Identify if attributes have missing data

ii)count the number of missing values in each of these attributes

In [13]:
import numpy as np

df_check_null = df_remove_dup.replace('?',np.NaN)

print('Number of instances = %d' % (df_check_null.shape[0]))
print('Number of attributes = %d' % (df_check_null.shape[1]))

print('Number of missing values:')
for col in df_check_null.columns:
    print('\t%s: %d' % (col,df_check_null[col].isna().sum()))

Number of instances = 351384
Number of attributes = 3
Number of missing values:
	wbt_date: 0
	wbt_time: 0
	wet_bulb_temperature: 0

Step 5: Drop missing data if any exists

In [14]:
print('Number of rows in original data = %d' % (df_check_null.shape[0]))
df_drop_null = df_check_null.dropna()
print('Number of rows after discarding missing values = %d' % (df_drop_null.shape[0]))

Number of rows in original data = 351384
Number of rows after discarding missing values = 351384

Part B: Data Mining